# NegativeBeltDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..NegativeBeltDistance Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Measurement Line Offset cannot be negative.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NegativeBeltDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NegativeBeltDistance As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NegativeBeltDistance {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace